[
  {
    "id": 1,
    "title": "Influenza",
    "content": "Influenza is a contagious respiratory infection caused by influenza viruses, leading to abrupt fever, cough, and body aches, with seasonal outbreaks. Common symptoms include fever, chills, dry cough, sore throat, runny or stuffy nose, headache, fatigue, and muscle aches. Emergency signs: trouble breathing, chest pain, confusion, bluish lips/face, severe dehydration, worsening after initial improvement. Risk factors: age <5 or >65, pregnancy, chronic lung/heart disease, diabetes, immunosuppression. Self-care: rest, hydration, acetaminophen/ibuprofen, isolate to reduce spread. Antivirals (e.g., oseltamivir) within 48 hours for high-risk or severe cases. Prevention: annual vaccination, hand hygiene. Contagious from 1 day before symptoms up to 5-7 days after.",
    "keywords": ["influenza", "flu", "seasonal influenza", "fever", "chills", "cough", "sore throat", "respiratory", "vaccine", "antiviral", "oseltamivir", "body aches"]
  },
  {
    "id": 2,
    "title": "COVID-19",
    "content": "COVID-19 is a viral respiratory illness caused by SARS-CoV-2, ranging from asymptomatic to severe pneumonia and systemic complications. Variants drive periodic waves; vaccination reduces severe disease. Common symptoms: fever, cough, fatigue, sore throat, headache, loss of taste/smell. Emergency signs: difficulty breathing, persistent chest pain, new confusion, cyanosis. Risk factors: age >65, chronic disease, obesity, diabetes, immunosuppression. Self-care: isolation, hydration, antipyretics. Antivirals available for eligible patients. Complications: pneumonia, thromboembolism, long COVID. Prevention: vaccination, masking. Follow public health guidance for isolation duration.",
    "keywords": ["COVID-19", "coronavirus", "SARS-CoV-2", "fever", "cough", "loss of taste", "loss of smell", "pandemic", "vaccination", "long COVID", "pneumonia", "respiratory"]
  },
  {
    "id": 3,
    "title": "Tuberculosis",
    "content": "Tuberculosis (TB) is a bacterial infection caused by Mycobacterium tuberculosis, commonly affecting lungs with chronic cough and weight loss. Can be latent or active and is curable with multi-drug therapy. Common symptoms: cough >3 weeks, fever, night sweats, weight loss. Emergency signs: massive hemoptysis, severe respiratory distress. Risk factors: close contact, HIV, malnutrition. Diagnosis: CXR, sputum smear/NAAT. Treatment: multi-drug therapy with adherence monitoring. Complications: respiratory failure, drug resistance. Latent TB has no symptoms and isn't contagious; active TB spreads through air. Prevention: early detection, BCG vaccine.",
    "keywords": ["tuberculosis", "TB", "pulmonary TB", "chronic cough", "weight loss", "night sweats", "bacterial", "hemoptysis", "multi-drug therapy", "mycobacterium"]
  },
  {
    "id": 4,
    "title": "Measles",
    "content": "Measles (rubeola) is a highly contagious viral illness with fever, cough, coryza, conjunctivitis, then rash; preventable by MMR vaccination. Common symptoms: high fever, cough, runny nose, red eyes, Koplik spots, maculopapular rash. Emergency signs: severe dehydration, respiratory distress. Risk factors: unvaccinated, travel. Treatment: supportive, vitamin A. Complications: pneumonia, encephalitis. One of the most contagious diseases; airborne particles linger for hours. Prevention: MMR vaccine.",
    "keywords": ["measles", "rubeola", "rash", "fever", "cough", "Koplik spots", "MMR", "vaccination", "contagious", "viral", "red eyes"]
  },
  {
    "id": 5,
    "title": "Chickenpox",
    "content": "Chickenpox (varicella) is a viral infection causing itchy rash and fever, mostly in children; preventable by vaccine. Common symptoms: fever, itchy rash, fatigue. Emergency signs: difficulty breathing, confusion, severe skin infection. Risk factors: unvaccinated, childhood. Self-care: calamine lotion, antihistamines, rest. Treatment: supportive, antivirals for high-risk. Complications: skin infection, pneumonia. Can affect adults more severely. Prevention: varicella vaccine.",
    "keywords": ["chickenpox", "varicella", "itchy rash", "fever", "blisters", "vaccine", "children", "viral", "skin infection"]
  },
  {
    "id": 6,
    "title": "Shingles",
    "content": "Shingles (herpes zoster) is reactivation of varicella-zoster virus causing painful rash, usually in older adults. Common symptoms: painful rash, burning, tingling. Emergency signs: eye involvement, severe pain. Risk factors: age >50, immunosuppression. Self-care: pain relief, cool compresses. Treatment: antivirals, pain management. Complications: postherpetic neuralgia. Can transmit chickenpox to unvaccinated. Prevention: zoster vaccine.",
    "keywords": ["shingles", "herpes zoster", "painful rash", "burning", "tingling", "postherpetic neuralgia", "antiviral", "vaccine", "elderly"]
  },
  {
    "id": 7,
    "title": "Hepatitis A",
    "content": "Hepatitis A is a viral liver infection spread by contaminated food/water; usually self-limited. Common symptoms: fatigue, nausea, jaundice, abdominal pain. Emergency signs: confusion, severe abdominal pain. Risk factors: travel, poor sanitation. Self-care: rest, hydration. Treatment: supportive. Complications: liver failure (rare). Does not cause chronic infection. Prevention: HAV vaccine, hand hygiene.",
    "keywords": ["hepatitis A", "HAV", "jaundice", "liver", "viral", "food-borne", "water-borne", "vaccine", "sanitation"]
  },
  {
    "id": 8,
    "title": "Hepatitis B",
    "content": "Hepatitis B is a viral liver infection spread via blood/body fluids; can become chronic and lead to cirrhosis or liver cancer. Often asymptomatic but may cause fatigue, nausea, jaundice. Emergency signs: confusion, severe abdominal pain. Risk factors: unprotected sex, needle sharing. Diagnosis: serology. Treatment: antivirals for chronic HBV. Complications: cirrhosis, liver cancer. Functional cure is rare; antivirals suppress virus. Prevention: HBV vaccine.",
    "keywords": ["hepatitis B", "HBV", "liver infection", "jaundice", "chronic", "cirrhosis", "liver cancer", "vaccination", "blood-borne"]
  },
  {
    "id": 9,
    "title": "Hepatitis C",
    "content": "Hepatitis C is a viral liver infection spread by blood; often chronic and treatable with antivirals. Common symptoms: fatigue, nausea, jaundice. Emergency signs: confusion, severe abdominal pain. Risk factors: needle sharing, blood transfusion. Diagnosis: serology, HCV RNA. Treatment: direct-acting antivirals. Complications: cirrhosis, liver cancer. Curable with modern antivirals. Prevention: safe needles.",
    "keywords": ["hepatitis C", "HCV", "liver", "viral", "chronic", "cirrhosis", "antiviral", "curable", "blood-borne", "injection drug use"]
  },
  {
    "id": 10,
    "title": "HIV/AIDS",
    "content": "HIV (Human Immunodeficiency Virus) is a chronic viral infection that weakens immunity; controlled with antiretroviral therapy (ART). Symptoms: acute viral syndrome, opportunistic infections if untreated. Emergency signs: severe infection, neurologic deficits. Risk factors: unprotected sex, needle sharing. Diagnosis: antigen/antibody tests. Treatment: ART. Complications: opportunistic infections. Not curable but controllable. With sustained viral suppression, sexual transmission is prevented (undetectable = untransmittable). Prevention: condoms, PrEP.",
    "keywords": ["HIV", "AIDS", "viral infection", "immunity", "ART", "antiretroviral", "opportunistic infections", "PrEP", "undetectable", "untransmittable"]
  },
  {
    "id": 11,
    "title": "Human Papillomavirus (HPV)",
    "content": "HPV is a group of viruses causing warts and cancers; some types are preventable by vaccine. Common symptoms: warts, often asymptomatic. Emergency signs: bleeding, painful lesions. Risk factors: unprotected sex. Self-care: wart treatments. Diagnosis: visual exam, Pap test. Treatment: wart removal, monitoring. Complications: cervical cancer. Most infections clear; some persist. Prevention: HPV vaccine.",
    "keywords": ["HPV", "human papillomavirus", "warts", "cervical cancer", "vaccine", "sexually transmitted", "genital warts", "Pap test"]
  },
  {
    "id": 12,
    "title": "Diphtheria",
    "content": "Diphtheria is a bacterial infection causing sore throat, fever, and airway obstruction; preventable by vaccine. Common symptoms: sore throat, fever, swollen neck. Emergency signs: airway obstruction. Risk factors: unvaccinated. Diagnosis: throat swab. Treatment: antitoxin, antibiotics. Complications: airway blockage. Contagious via respiratory droplets. Prevention: DTaP vaccine.",
    "keywords": ["diphtheria", "bacterial", "sore throat", "airway obstruction", "DTaP", "vaccine", "antitoxin", "respiratory"]
  },
  {
    "id": 13,
    "title": "Tetanus",
    "content": "Tetanus is a bacterial infection causing muscle stiffness and spasms; preventable by vaccine. Common symptoms: muscle stiffness, jaw lock (lockjaw). Emergency signs: difficulty breathing. Risk factors: unvaccinated, wound exposure. Self-care: wound care. Diagnosis: clinical features. Treatment: antitoxin, antibiotics. Complications: respiratory failure. Not contagious person-to-person. Prevention: DTaP vaccine.",
    "keywords": ["tetanus", "lockjaw", "muscle stiffness", "spasms", "bacterial", "DTaP", "vaccine", "wound", "Clostridium tetani"]
  },
  {
    "id": 14,
    "title": "Pertussis",
    "content": "Pertussis (whooping cough) is a bacterial infection causing severe coughing fits; preventable by vaccine. Common symptoms: severe cough, whoop sound. May cause vomiting after cough. Emergency signs: difficulty breathing. Risk factors: unvaccinated, infants. Self-care: hydration. Diagnosis: nasal swab. Treatment: antibiotics. Complications: pneumonia. Can be severe in infants. Prevention: DTaP vaccine.",
    "keywords": ["pertussis", "whooping cough", "severe cough", "bacterial", "DTaP", "vaccine", "infants", "Bordetella pertussis"]
  },
  {
    "id": 15,
    "title": "Meningococcal Disease",
    "content": "Meningococcal disease is a bacterial infection causing meningitis and sepsis; rapid progression and high risk. Common symptoms: fever, headache, neck stiffness, rash. Emergency signs: altered mental status, seizures. Risk factors: crowded settings. Diagnosis: lumbar puncture. Treatment: antibiotics. Complications: sepsis, brain damage. Contagious via respiratory droplets. Prevention: meningococcal vaccine.",
    "keywords": ["meningococcal disease", "meningitis", "sepsis", "bacterial", "fever", "neck stiffness", "vaccine", "Neisseria meningitidis"]
  },
  {
    "id": 16,
    "title": "Rubella",
    "content": "Rubella is a mild viral illness with rash; dangerous in pregnancy; preventable by vaccine. Common symptoms: rash, fever, swollen lymph nodes. May cause joint pain. Emergency signs: pregnancy exposure. Risk factors: unvaccinated. Self-care: rest. Diagnosis: serology. Treatment: supportive. Complications: birth defects if contracted during pregnancy. Prevention: MMR vaccine.",
    "keywords": ["rubella", "German measles", "rash", "fever", "pregnancy", "birth defects", "MMR", "vaccine", "congenital rubella"]
  },
  {
    "id": 17,
    "title": "Rotavirus Infection",
    "content": "Rotavirus infection is a viral infection causing severe diarrhea in infants and children; preventable by vaccine. Common symptoms: diarrhea, vomiting, fever. Emergency signs: severe dehydration. Risk factors: infants, unvaccinated. Self-care: oral rehydration. Diagnosis: stool test. Treatment: supportive. Complications: dehydration. Can cause severe dehydration. Prevention: rotavirus vaccine.",
    "keywords": ["rotavirus", "diarrhea", "vomiting", "dehydration", "infants", "children", "vaccine", "gastroenteritis"]
  },
  {
    "id": 18,
    "title": "Dengue",
    "content": "Dengue is a mosquito-borne viral illness causing fever, pain, and sometimes bleeding; common in tropics. Common symptoms: high fever, joint pain, rash. Emergency signs: severe bleeding, shock. Risk factors: tropical travel. Self-care: hydration, rest. Diagnosis: blood test. Treatment: supportive. Complications: shock, organ failure. Can be fatal if severe. Prevention: mosquito control.",
    "keywords": ["dengue", "dengue fever", "mosquito-borne", "fever", "joint pain", "tropical", "bleeding", "Aedes mosquito"]
  },
  {
    "id": 19,
    "title": "Zika",
    "content": "Zika is a mosquito-borne viral illness; mild in most but can cause birth defects if pregnant. Common symptoms: fever, rash, joint pain. May cause conjunctivitis. Emergency signs: pregnancy exposure. Risk factors: tropical travel. Self-care: rest. Diagnosis: blood test. Treatment: supportive. Complications: birth defects (microcephaly). Dangerous in pregnancy. Prevention: mosquito control.",
    "keywords": ["Zika", "mosquito-borne", "fever", "rash", "pregnancy", "birth defects", "microcephaly", "tropical", "Aedes mosquito"]
  },
  {
    "id": 20,
    "title": "Ebola Virus Disease",
    "content": "Ebola virus disease is a severe viral hemorrhagic fever with high fatality; outbreaks in Africa. Common symptoms: fever, vomiting, bleeding. Emergency signs: bleeding, shock. Risk factors: outbreak exposure. Diagnosis: PCR. Treatment: supportive. Complications: multi-organ failure. Contagious via body fluids. Prevention: avoid exposure, infection control.",
    "keywords": ["Ebola", "hemorrhagic fever", "viral", "bleeding", "Africa", "outbreak", "high fatality", "body fluids"]
  },
  {
    "id": 21,
    "title": "Malaria",
    "content": "Malaria is a mosquito-borne parasitic infection causing fever, chills, and anemia; treatable with antimalarials. Common symptoms: fever, chills, sweats. May cause headache, nausea. Emergency signs: confusion, severe anemia. Risk factors: tropical travel. Diagnosis: blood smear. Treatment: antimalarials. Complications: organ failure. Curable with treatment. Prevention: mosquito control, prophylaxis.",
    "keywords": ["malaria", "mosquito-borne", "parasitic", "fever", "chills", "antimalarial", "tropical", "Plasmodium", "Anopheles mosquito"]
  },
  {
    "id": 22,
    "title": "Lyme Disease",
    "content": "Lyme disease is a tick-borne bacterial infection causing rash, fever, and joint pain; treatable with antibiotics. Common symptoms: bullseye rash, fever, joint pain. Emergency signs: neurologic symptoms. Risk factors: tick exposure. Self-care: tick removal. Diagnosis: serology. Treatment: antibiotics. Complications: arthritis. Curable with antibiotics. Prevention: tick avoidance.",
    "keywords": ["Lyme disease", "tick-borne", "bacterial", "bullseye rash", "joint pain", "Borrelia", "antibiotics", "deer tick"]
  },
  {
    "id": 23,
    "title": "Chlamydia",
    "content": "Chlamydia is a common sexually transmitted bacterial infection; often asymptomatic but treatable. Common symptoms: discharge, painful urination. May cause pelvic pain. Emergency signs: severe pelvic pain. Risk factors: unprotected sex. Diagnosis: urine or swab test. Treatment: antibiotics. Complications: infertility. Curable with antibiotics. Prevention: condoms.",
    "keywords": ["chlamydia", "STI", "sexually transmitted", "bacterial", "discharge", "painful urination", "antibiotics", "pelvic inflammatory disease"]
  },
  {
    "id": 24,
    "title": "Gonorrhea",
    "content": "Gonorrhea is a sexually transmitted bacterial infection; treatable but can cause complications. Common symptoms: discharge, painful urination. May cause pelvic pain. Emergency signs: severe pelvic pain. Risk factors: unprotected sex. Diagnosis: urine or swab test. Treatment: antibiotics. Complications: infertility. Curable with antibiotics. Prevention: condoms.",
    "keywords": ["gonorrhea", "STI", "sexually transmitted", "bacterial", "discharge", "painful urination", "antibiotics", "Neisseria gonorrhoeae"]
  },
  {
    "id": 25,
    "title": "Syphilis",
    "content": "Syphilis is a sexually transmitted bacterial infection with stages; treatable with antibiotics. Common symptoms: painless sore, rash. May cause neurologic symptoms. Emergency signs: confusion, vision changes. Risk factors: unprotected sex. Diagnosis: blood test. Treatment: antibiotics. Complications: neurologic damage. Curable with antibiotics. Prevention: condoms.",
    "keywords": ["syphilis", "STI", "sexually transmitted", "bacterial", "painless sore", "rash", "antibiotics", "Treponema pallidum"]
  },
  {
    "id": 26,
    "title": "Cholera",
    "content": "Cholera is a bacterial infection causing severe watery diarrhea; rapid dehydration risk. Common symptoms: watery diarrhea, vomiting. May cause leg cramps. Emergency signs: severe dehydration. Risk factors: contaminated water. Self-care: oral rehydration. Diagnosis: stool test. Treatment: rehydration, antibiotics. Complications: shock. Can be fatal if untreated. Prevention: clean water.",
    "keywords": ["cholera", "bacterial", "watery diarrhea", "dehydration", "contaminated water", "Vibrio cholerae", "rehydration"]
  },
  {
    "id": 27,
    "title": "Typhoid Fever",
    "content": "Typhoid fever is a bacterial infection causing prolonged fever and abdominal pain; treatable with antibiotics. Common symptoms: fever, abdominal pain, headache. May cause rash. Emergency signs: confusion, severe abdominal pain. Risk factors: contaminated food/water. Diagnosis: blood/stool test. Treatment: antibiotics. Complications: intestinal perforation. Curable with antibiotics. Prevention: clean water, vaccine.",
    "keywords": ["typhoid fever", "bacterial", "fever", "abdominal pain", "Salmonella typhi", "antibiotics", "contaminated water"]
  },
  {
    "id": 28,
    "title": "Polio",
    "content": "Polio is a viral infection causing paralysis; preventable by vaccine. Common symptoms: fever, muscle weakness. May cause paralysis. Emergency signs: difficulty breathing. Risk factors: unvaccinated. Diagnosis: stool test. Treatment: supportive. Complications: paralysis. Rare but outbreaks occur. Prevention: polio vaccine.",
    "keywords": ["polio", "poliomyelitis", "viral", "paralysis", "muscle weakness", "vaccine", "poliovirus", "iron lung"]
  },
  {
    "id": 29,
    "title": "Anthrax",
    "content": "Anthrax is a bacterial infection from spores; can affect skin, lungs, or GI tract. Common symptoms: skin ulcer, fever. May cause cough, chest pain. Emergency signs: difficulty breathing. Risk factors: animal exposure. Diagnosis: culture. Treatment: antibiotics. Complications: sepsis. Not contagious person-to-person. Prevention: avoid exposure, vaccine for high-risk.",
    "keywords": ["anthrax", "bacterial", "skin ulcer", "spores", "Bacillus anthracis", "antibiotics", "bioterrorism"]
  },
  {
    "id": 30,
    "title": "Legionnaires' Disease",
    "content": "Legionnaires' disease is a bacterial pneumonia from contaminated water sources. Common symptoms: fever, cough, shortness of breath. May cause muscle aches. Emergency signs: difficulty breathing. Risk factors: contaminated water. Diagnosis: urine antigen, culture. Treatment: antibiotics. Complications: respiratory failure. Not contagious person-to-person. Prevention: clean water systems.",
    "keywords": ["Legionnaires' disease", "Legionella", "bacterial", "pneumonia", "fever", "cough", "contaminated water", "cooling towers"]
  },
  {
    "id": 31,
    "title": "Ischemic Heart Disease",
    "content": "Ischemic heart disease (coronary artery disease) is narrowing of coronary arteries causing angina, heart attack, or silent ischemia. Common symptoms: chest pain, shortness of breath. May cause nausea, sweating. Emergency signs: chest pain >10 min, new severe shortness of breath. Risk factors: age, hypertension, diabetes, smoking. Diagnosis: ECG, troponin. Treatment: antiplatelets, statins. Complications: heart failure. Prevention: BP, lipids, exercise. Cardiac pain is pressure-like, exertional.",
    "keywords": ["ischemic heart disease", "coronary artery disease", "angina", "heart attack", "myocardial infarction", "chest pain", "cardiovascular", "CAD"]
  },
  {
    "id": 32,
    "title": "Stroke",
    "content": "Stroke (cerebrovascular disease) is sudden loss of brain function from blocked or burst blood vessel; emergency. Common symptoms: facial droop, arm weakness, speech difficulty. May cause vision loss. Emergency signs: any sudden neurologic deficit. Risk factors: hypertension, atrial fibrillation. Diagnosis: CT, MRI. Treatment: thrombolysis, rehab. Complications: disability. Prevention: BP control. FAST signs: Face, Arm, Speech, Time to call emergency.",
    "keywords": ["stroke", "cerebrovascular accident", "CVA", "FAST", "facial droop", "arm weakness", "speech difficulty", "brain attack", "TIA"]
  },
  {
    "id": 33,
    "title": "COPD",
    "content": "COPD (chronic obstructive pulmonary disease) is chronic lung disease causing cough, sputum, and breathlessness. Common symptoms: cough, sputum, shortness of breath. May cause wheezing. Emergency signs: severe breathlessness. Risk factors: smoking. Self-care: inhalers, smoking cessation. Diagnosis: spirometry. Treatment: inhalers, oxygen. Complications: respiratory failure. Not curable but manageable. Prevention: no smoking.",
    "keywords": ["COPD", "chronic obstructive pulmonary disease", "emphysema", "chronic bronchitis", "cough", "sputum", "smoking", "breathlessness"]
  },
  {
    "id": 34,
    "title": "Pneumonia",
    "content": "Pneumonia is infection of the lungs causing cough, fever, and breathlessness. Common symptoms: cough, fever, shortness of breath. May cause chest pain. Emergency signs: difficulty breathing. Risk factors: age, chronic disease. Self-care: rest, hydration. Diagnosis: chest X-ray. Treatment: antibiotics. Complications: respiratory failure. Some types are contagious. Prevention: vaccines (pneumococcal, flu).",
    "keywords": ["pneumonia", "lung infection", "cough", "fever", "breathlessness", "bacterial", "viral", "chest X-ray", "antibiotics"]
  },
  {
    "id": 35,
    "title": "Diabetes Mellitus",
    "content": "Diabetes mellitus (type 2 diabetes) is chronic insulin resistance and high blood sugar; risk for complications. Common symptoms: thirst, frequent urination, fatigue. May cause blurred vision. Emergency signs: confusion, vomiting. Risk factors: overweight, family history. Self-care: diet, exercise. Diagnosis: A1C, FPG. Treatment: metformin, lifestyle. Complications: retinopathy, neuropathy. Type 2 can be reversed in some. Prevention: weight management.",
    "keywords": ["diabetes", "type 2 diabetes", "T2D", "blood sugar", "glucose", "insulin resistance", "A1C", "metformin", "hyperglycemia"]
  },
  {
    "id": 36,
    "title": "Chronic Kidney Disease",
    "content": "Chronic kidney disease (CKD) is progressive loss of kidney function; risk for complications. Common symptoms: fatigue, swelling, urination changes. May cause nausea. Emergency signs: confusion, severe swelling. Risk factors: diabetes, hypertension. Self-care: diet, fluid management. Diagnosis: blood tests, urine tests. Treatment: medications, dialysis. Complications: heart disease. Not curable but progression can be slowed. Prevention: BP, sugar control.",
    "keywords": ["chronic kidney disease", "CKD", "kidney failure", "renal disease", "dialysis", "creatinine", "GFR", "nephropathy"]
  },
  {
    "id": 37,
    "title": "Liver Cirrhosis",
    "content": "Liver cirrhosis is scarring of the liver from chronic damage; risk for complications. Common symptoms: fatigue, jaundice, swelling. May cause itching. Emergency signs: confusion, bleeding. Risk factors: alcohol, hepatitis. Self-care: avoid alcohol. Diagnosis: blood tests, imaging. Treatment: medications, transplant. Complications: liver failure. Not reversible but complications can be managed. Prevention: no alcohol, vaccines.",
    "keywords": ["cirrhosis", "liver disease", "scarring", "jaundice", "alcohol", "hepatitis", "ascites", "portal hypertension", "liver failure"]
  },
  {
    "id": 38,
    "title": "Alzheimer's Disease",
    "content": "Alzheimer's disease is progressive memory loss and cognitive decline; most common dementia. Common symptoms: memory loss, confusion. May cause behavior changes. Emergency signs: wandering, agitation. Risk factors: age, family history. Self-care: routine, safety. Diagnosis: cognitive tests. Treatment: medications. Complications: disability. Not curable but progression can be slowed. Prevention: healthy lifestyle.",
    "keywords": ["Alzheimer's disease", "dementia", "memory loss", "cognitive decline", "confusion", "elderly", "neurologic", "caregiver"]
  },
  {
    "id": 39,
    "title": "Parkinson's Disease",
    "content": "Parkinson's disease is progressive movement disorder with tremor, stiffness, and slow movement. Common symptoms: tremor, stiffness, slow movement. May cause balance problems. Emergency signs: falls. Risk factors: age. Self-care: exercise. Diagnosis: clinical exam. Treatment: medications. Complications: falls. Not curable but symptoms can be managed. Prevention: none known.",
    "keywords": ["Parkinson's disease", "movement disorder", "tremor", "stiffness", "bradykinesia", "neurologic", "dopamine", "elderly"]
  },
  {
    "id": 40,
    "title": "Hypertensive Heart Disease",
    "content": "Hypertensive heart disease is heart problems caused by high blood pressure. Common symptoms: chest pain, shortness of breath. May cause fatigue. Emergency signs: chest pain. Risk factors: hypertension. Self-care: BP control. Diagnosis: ECG, echo. Treatment: BP meds. Complications: heart failure. Damage can be limited. Prevention: BP control.",
    "keywords": ["hypertensive heart disease", "high blood pressure", "hypertension", "heart disease", "chest pain", "cardiovascular", "left ventricular hypertrophy"]
  },
  {
    "id": 41,
    "title": "Heart Failure",
    "content": "Heart failure is when heart is unable to pump enough blood; causes fatigue and swelling. Common symptoms: fatigue, swelling, shortness of breath. May cause cough. Emergency signs: severe breathlessness. Risk factors: heart disease. Self-care: fluid management. Diagnosis: echo. Treatment: medications. Complications: hospitalization. Not curable but treatable. Prevention: BP, heart health.",
    "keywords": ["heart failure", "congestive heart failure", "CHF", "fatigue", "swelling", "edema", "shortness of breath", "cardiovascular"]
  },
  {
    "id": 42,
    "title": "Lung Cancer",
    "content": "Lung cancer is cancer of the lungs; often related to smoking. Common symptoms: cough, weight loss, chest pain. May cause hemoptysis. Emergency signs: difficulty breathing. Risk factors: smoking. Diagnosis: imaging, biopsy. Treatment: surgery, chemo. Complications: spread (metastasis). Early stage can be curable. Prevention: no smoking.",
    "keywords": ["lung cancer", "cancer", "smoking", "cough", "chest pain", "hemoptysis", "biopsy", "chemotherapy", "metastasis"]
  },
  {
    "id": 43,
    "title": "Colorectal Cancer",
    "content": "Colorectal cancer is cancer of the colon or rectum; screening is important. Common symptoms: blood in stool, weight loss. May cause abdominal pain. Emergency signs: severe pain. Risk factors: age, family history. Self-care: screening. Diagnosis: colonoscopy. Treatment: surgery, chemo. Complications: spread. Early stage can be curable. Prevention: screening.",
    "keywords": ["colorectal cancer", "colon cancer", "rectal cancer", "blood in stool", "colonoscopy", "screening", "polyp", "cancer"]
  },
  {
    "id": 44,
    "title": "Breast Cancer",
    "content": "Breast cancer is cancer of the breast; screening and early detection are key. Common symptoms: lump, skin changes. May cause pain. Emergency signs: skin ulceration. Risk factors: female, family history. Self-care: screening. Diagnosis: mammogram, biopsy. Treatment: surgery, chemo. Complications: spread. Early stage can be curable. Prevention: screening.",
    "keywords": ["breast cancer", "cancer", "lump", "mammogram", "biopsy", "screening", "mastectomy", "female", "BRCA"]
  },
  {
    "id": 45,
    "title": "Prostate Cancer",
    "content": "Prostate cancer is cancer of the prostate; common in older men. Common symptoms: urination changes, pain. May cause blood in urine. Emergency signs: urinary retention. Risk factors: age, family history. Self-care: screening. Diagnosis: PSA, biopsy. Treatment: surgery, radiation. Complications: spread. Early stage can be curable. Prevention: screening.",
    "keywords": ["prostate cancer", "cancer", "PSA", "urination", "biopsy", "male", "elderly", "screening", "prostatectomy"]
  },
  {
    "id": 46,
    "title": "Stomach Cancer",
    "content": "Stomach cancer (gastric cancer) is cancer of the stomach; often diagnosed late. Common symptoms: abdominal pain, weight loss. May cause nausea. Emergency signs: vomiting blood. Risk factors: age, H. pylori. Diagnosis: endoscopy, biopsy. Treatment: surgery, chemo. Complications: spread. Early stage can be curable. Prevention: healthy diet.",
    "keywords": ["stomach cancer", "gastric cancer", "cancer", "abdominal pain", "weight loss", "H. pylori", "endoscopy", "biopsy"]
  },
  {
    "id": 47,
    "title": "Major Depressive Disorder",
    "content": "Major depressive disorder is a mental health condition with persistent sadness and loss of interest. Common symptoms: sadness, loss of interest, fatigue. May cause sleep changes. Emergency signs: suicidal thoughts. Risk factors: family history, stress. Self-care: support, routine. Diagnosis: clinical interview. Treatment: therapy, medications. Complications: disability. Treatable with therapy and meds. Prevention: stress management.",
    "keywords": ["major depressive disorder", "depression", "mental health", "sadness", "loss of interest", "fatigue", "therapy", "antidepressant", "suicide"]
  },
  {
    "id": 48,
    "title": "Bipolar Disorder",
    "content": "Bipolar disorder is a mental health condition with mood swings between depression and mania. Common symptoms: mood swings, high energy, sadness. May cause sleep changes. Emergency signs: suicidal thoughts. Risk factors: family history. Self-care: routine. Diagnosis: clinical interview. Treatment: therapy, medications. Complications: disability. Treatable with therapy and meds. Prevention: stress management.",
    "keywords": ["bipolar disorder", "mental health", "mood swings", "mania", "depression", "therapy", "mood stabilizer", "lithium"]
  },
  {
    "id": 49,
    "title": "Schizophrenia",
    "content": "Schizophrenia is a mental health condition with hallucinations, delusions, and disorganized thinking. Common symptoms: hallucinations, delusions, disorganized speech. May cause social withdrawal. Emergency signs: suicidal thoughts. Risk factors: family history. Self-care: support. Diagnosis: clinical interview. Treatment: therapy, medications. Complications: disability. Treatable but often chronic. Prevention: early intervention.",
    "keywords": ["schizophrenia", "mental health", "hallucinations", "delusions", "psychosis", "antipsychotic", "therapy", "psychiatric"]
  },
  {
    "id": 50,
    "title": "Asthma",
    "content": "Asthma (reactive airway disease) is chronic airway inflammation with variable obstruction and hyperresponsiveness. Common symptoms: wheezing, shortness of breath, chest tightness. May cause cough. Emergency signs: speaking in single words, cyanosis. Risk factors: atopy, family history. Self-care: inhaler, avoid triggers. Diagnosis: spirometry. Treatment: inhalers (corticosteroids, bronchodilators). Complications: severe attacks. Not curable but manageable. Prevention: trigger avoidance.",
    "keywords": ["asthma", "reactive airway disease", "wheezing", "shortness of breath", "chest tightness", "inhaler", "bronchodilator", "corticosteroids", "respiratory", "allergies"]
  },
  {
    "id": 51,
    "title": "Common Cold",
    "content": "Common cold is a mild viral infection of the nose and throat causing sneezing, runny nose, and sore throat. Common symptoms: runny nose, sneezing, sore throat, cough, mild fever. May cause headache, fatigue. Emergency signs: difficulty breathing, high fever >39°C. Risk factors: close contact, crowded settings, cold weather. Self-care: rest, hydration, saline spray, OTC decongestants as directed. When to seek care: symptoms >10 days, worsening after initial improvement, severe ear or sinus pain. Diagnosis: clinical assessment. Treatment: supportive care. Complications: sinusitis, otitis media, bronchitis. Prevention: hand hygiene, avoid close contact. Most resolve in 7-10 days. Highly contagious via respiratory droplets.",
    "keywords": ["common cold", "cold", "upper respiratory infection", "URI", "runny nose", "sneezing", "congestion", "viral", "rhinovirus", "sore throat", "nasal", "mucus"]
  },
  {
    "id": 52,
    "title": "Headache",
    "content": "Headache (cephalgia) is head pain commonly due to tension, migraine, or sinus causes. Common symptoms: head pain, pressure, tight band sensation, throbbing. May cause nausea, light sensitivity, photophobia. Emergency signs: sudden worst headache, fever with neck stiffness, neurologic deficit, head trauma, vision changes. Risk factors: stress, dehydration, lack of sleep, caffeine withdrawal, poor posture. Self-care: hydration, rest in dark room, OTC analgesics as directed, cold/hot compress. When to seek care: new severe headache, progressive pattern, neurologic symptoms. Diagnosis: history and exam, consider imaging if red flags. Treatment: analgesics, stress management, migraine-specific meds if indicated. Complications: medication overuse headache, chronic daily headache. Prevention: sleep hygiene, hydration, trigger tracking, regular meals.",
    "keywords": ["headache", "cephalgia", "head pain", "migraine", "tension headache", "pressure", "throbbing", "pain", "stress headache", "sinus headache", "cluster headache", "photophobia"]
  },
  {
    "id": 53,
    "title": "Sore Throat",
    "content": "Sore throat (pharyngitis) is throat pain from viral or bacterial irritation or infection. Common symptoms: throat pain, pain with swallowing, hoarseness, scratchiness. May cause fever, swollen neck glands, red throat. Emergency signs: trouble breathing, drooling, severe pain or swelling, difficulty swallowing saliva. Risk factors: close contact, cold/flu season, smoking exposure. Self-care: warm fluids, lozenges, salt-water gargle, OTC pain relievers, honey (if age >1 year). When to seek care: severe pain, >3 days with high fever, rash or neck stiffness. Diagnosis: clinical exam, rapid strep test as indicated. Treatment: supportive care, antibiotics if strep positive. Complications: tonsillitis, peritonsillar abscess, rheumatic fever (rare). Prevention: hand hygiene, avoid sharing utensils. Most are viral; testing guides antibiotics.",
    "keywords": ["sore throat", "pharyngitis", "throat pain", "swallowing pain", "strep throat", "tonsillitis", "hoarseness", "red throat", "swollen glands", "streptococcal", "throat infection"]
  },
  {
    "id": 54,
    "title": "Cough",
    "content": "Cough is a protective reflex clearing airways; common with colds, allergies, or irritants. Common symptoms: coughing, throat tickle, chest discomfort. May cause wheeze, phlegm production. Emergency signs: coughing blood (hemoptysis), breathing difficulty, blue lips, high fever. Risk factors: URIs, smoke exposure, asthma, GERD, allergies. Self-care: hydration, honey if age ≥1 year, humidifier, avoid irritants. When to seek care: cough >3 weeks, fever >3 days, bloody sputum, severe shortness of breath. Diagnosis: clinical assessment, chest X-ray if persistent. Treatment: treat underlying cause, cough suppressants if appropriate. Complications: bronchitis, pneumonia, rib fracture from severe coughing. Prevention: avoid smoke, allergens, treat underlying conditions. Most acute coughs resolve in 1-3 weeks.",
    "keywords": ["cough", "coughing", "persistent cough", "dry cough", "productive cough", "throat tickle", "chest cough", "bronchitis", "whooping", "hacking", "phlegm", "sputum"]
  },
  {
    "id": 55,
    "title": "Fever",
    "content": "Fever (pyrexia) is elevated body temperature, usually due to infection or inflammation. Common symptoms: high temperature (>38°C/100.4°F), chills, sweating, flushed skin. May cause headache, body aches, fatigue, loss of appetite. Emergency signs: fever >40°C (104°F), confusion, seizures, severe headache, stiff neck, difficulty breathing, rash. Risk factors: infections (viral/bacterial), immunization, heat exhaustion. Self-care: rest, hydration, light clothing, tepid sponging, antipyretics (acetaminophen, ibuprofen) as directed. When to seek care: fever >3 days, very high fever, infant <3 months with fever, immunocompromised. Diagnosis: temperature measurement, blood tests if indicated. Treatment: treat underlying cause, antipyretics for comfort. Complications: febrile seizures (children), dehydration. Prevention: hand hygiene, vaccinations. Fever itself is not dangerous unless very high or prolonged.",
    "keywords": ["fever", "pyrexia", "high temperature", "chills", "sweating", "body temperature", "infection", "febrile", "antipyretic", "acetaminophen", "ibuprofen", "thermometer"]
  },
  {
    "id": 56,
    "title": "Diarrhea",
    "content": "Diarrhea is frequent loose or watery stools, often due to infection, food intolerance, or medication. Common symptoms: loose stools, watery bowel movements, abdominal cramps, urgency. May cause fever, vomiting, nausea, bloating. Emergency signs: blood in stool, severe dehydration (dry mouth, dizziness, decreased urination), high fever, severe abdominal pain. Risk factors: contaminated food/water, travel, antibiotics, food intolerances. Self-care: oral rehydration solution (ORS), clear fluids, BRAT diet (bananas, rice, applesauce, toast), rest. When to seek care: persistent diarrhea >2 days, blood in stool, signs of dehydration, high fever. Diagnosis: stool test, clinical assessment. Treatment: rehydration, treat underlying cause, probiotics may help. Complications: dehydration, electrolyte imbalance. Prevention: clean water, hand hygiene, food safety, careful with travel. Can be serious if dehydration develops.",
    "keywords": ["diarrhea", "loose stools", "watery stools", "abdominal cramps", "gastroenteritis", "food poisoning", "stomach bug", "traveler's diarrhea", "dehydration", "bowel movements", "intestinal"]
  },
  {
    "id": 57,
    "title": "Constipation",
    "content": "Constipation is difficulty passing stools or infrequent bowel movements, often due to diet, dehydration, or inactivity. Common symptoms: infrequent stools (<3 per week), hard stools, straining, feeling of incomplete evacuation. May cause abdominal pain, bloating, rectal discomfort. Emergency signs: severe abdominal pain, vomiting, no bowel movement with abdominal distension, blood in stool. Risk factors: low fiber diet, dehydration, sedentary lifestyle, medications (opioids, iron), ignoring urge. Self-care: increase fiber (fruits, vegetables, whole grains), hydration (8+ glasses water), regular exercise, establish routine. When to seek care: no bowel movement >1 week, severe pain, unexplained weight loss, blood in stool. Diagnosis: clinical assessment, abdominal exam. Treatment: dietary changes, fiber supplements, stool softeners, laxatives if needed. Complications: hemorrhoids, anal fissures, fecal impaction. Prevention: fiber-rich diet, adequate fluids, physical activity, respond to urge promptly.",
    "keywords": ["constipation", "hard stools", "infrequent bowel movements", "straining", "bloating", "fiber", "bowel", "laxative", "stool softener", "irregular", "backed up"]
  },
  {
    "id": 58,
    "title": "Allergies",
    "content": "Allergies (hay fever, allergic rhinitis) are immune reactions to harmless substances like pollen, dust, pet dander, or certain foods. Common symptoms: sneezing, runny nose, itchy watery eyes, nasal congestion, postnasal drip. May cause rash, hives, wheezing, itchy throat. Emergency signs: difficulty breathing, throat swelling, swelling of lips/tongue/face (anaphylaxis), chest tightness, severe wheezing. Risk factors: family history, asthma, eczema, environmental exposure. Self-care: avoid known triggers, antihistamines, nasal saline rinse, keep windows closed during high pollen. When to seek care: symptoms interfere with daily life, severe reaction, suspected anaphylaxis. Diagnosis: clinical history, skin prick testing, blood IgE testing. Treatment: antihistamines, nasal corticosteroids, immunotherapy (allergy shots), epinephrine for anaphylaxis. Complications: sinusitis, asthma exacerbation, sleep disturbance. Prevention: identify and avoid triggers, allergen-proof bedroom. Most allergies are managed, not cured.",
    "keywords": ["allergies", "allergic rhinitis", "hay fever", "seasonal allergies", "sneezing", "runny nose", "itchy eyes", "antihistamine", "pollen", "dust", "pet dander", "food allergy", "anaphylaxis", "hives"]
  },
  {
    "id": 59,
    "title": "Earache",
    "content": "Earache (otalgia) is pain in the ear, often due to infection (otitis media), fluid buildup, or external irritation. Common symptoms: ear pain (sharp, dull, or throbbing), feeling of fullness, hearing loss, discharge. May cause fever, irritability (in children), difficulty sleeping. Emergency signs: severe pain, bloody or purulent discharge, facial weakness, dizziness, high fever. Risk factors: recent cold/URI, swimming, allergies, young age, bottle-feeding while lying down. Self-care: warm compress, OTC pain relievers (acetaminophen, ibuprofen), avoid inserting objects in ear. When to seek care: persistent pain >2 days, fever, hearing loss, discharge, symptoms in infant. Diagnosis: otoscopic examination (looking in ear). Treatment: pain relievers, antibiotics if bacterial infection (otitis media), ear drops for swimmer's ear. Complications: hearing loss, chronic infection, mastoiditis (rare). Prevention: dry ears after swimming, treat allergies/colds promptly, avoid secondhand smoke. Most earaches resolve with treatment.",
    "keywords": ["earache", "otalgia", "ear pain", "ear infection", "otitis media", "hearing loss", "ear discharge", "swimmer's ear", "middle ear", "eardrum", "otitis externa"]
  },
  {
    "id": 60,
    "title": "Stomach Ache",
    "content": "Stomach ache (abdominal pain) is pain in the abdomen, often due to indigestion, gas, infection, constipation, or food intolerance. Common symptoms: abdominal pain (cramping, sharp, or dull), discomfort, tenderness. May cause nausea, bloating, gas, changes in bowel habits. Emergency signs: severe persistent pain, vomiting blood, bloody or black stools, rigid abdomen, fever with pain, pain radiating to shoulder. Risk factors: dietary triggers, stress, infections, food poisoning, lactose intolerance, IBS. Self-care: rest, clear fluids, bland diet, avoid trigger foods, heating pad, small frequent meals. When to seek care: severe pain, persistent vomiting, signs of dehydration, fever, pain with pregnancy. Diagnosis: clinical assessment, physical exam, blood tests, imaging if needed. Treatment: depends on cause - antacids for indigestion, antibiotics for infection, dietary changes. Complications: dehydration from vomiting/diarrhea, progression of underlying condition. Prevention: healthy balanced diet, food safety, stress management, adequate hydration. Serious if severe, persistent, or with concerning signs.",
    "keywords": ["stomach ache", "abdominal pain", "belly pain", "stomach pain", "cramps", "tummy ache", "nausea", "bloating", "indigestion", "gastritis", "upset stomach", "gas pain"]
  }
]
